apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_ble_adapter.c
      if (ret < 0)
        {
          wlerr("Failed to receive from mqueue error=%d\n", ret);
        }
    }
  else
    {
      ret = clock_gettime(CLOCK_REALTIME, &timeout);

      if (ret < 0)
        {
          wlerr("Failed to get time\n");
          return false;
        }

      if (block_time_ms)
        {
          esp_update_time(&timeout, MSEC2TICK(block_time_ms));
        }

      ret = file_mq_timedreceive(&mq_adpt->mq, (char *)item,
                                 mq_adpt->msgsize, &prio, &timeout);

      if (ret < 0)
        {
          wlerr("Failed to timedreceive from mqueue error=%d\n", ret);
        }
    }

  return ret > 0 ? true : false;
}

/****************************************************************************
 * Name: queue_delete_wrapper
 *
 * Description:
 *   Delete message queue
 *
 * Input Parameters:
 *   queue - Message queue data pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void queue_delete_wrapper(void *queue)
{
  struct mq_adpt_s *mq_adpt = (struct mq_adpt_s *)queue;

  file_mq_close(&mq_adpt->mq);
  file_mq_unlink(mq_adpt->name);
  kmm_free(mq_adpt);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32c3_bt_controller_init
 *
 * Description:
 *    Init  BT controller.
 *
 * Input Parameters:
 *    None
 *
 * Returned Value:
 *    None
 *
 ****************************************************************************/

int esp32c3_bt_controller_init(void)
{
  esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
  esp_bt_controller_config_t *cfg = &bt_cfg;
#ifdef CONFIG_PM
  bool select_src_ret;
  bool set_div_ret;
#endif

  if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE)
    {
      wlerr("Invalid controller status");
      return -1;
    }

  cfg->controller_task_stack_size       = CONFIG_ESP32C3_BLE_TASK_STACK_SIZE;
  cfg->controller_task_prio             = CONFIG_ESP32C3_BLE_TASK_PRIORITY;

  cfg->controller_task_run_cpu          = 0;
  cfg->ble_max_act                      = 10;
  cfg->sleep_mode                       = 0;
  cfg->coex_phy_coded_tx_rx_time_limit  = 0;
  cfg->bluetooth_mode                   = 1;
  cfg->sleep_clock                      = 0;
  cfg->ble_st_acl_tx_buf_nb             = 0;
  cfg->ble_hw_cca_check                 = 0;
  cfg->ble_adv_dup_filt_max             = 30;
  cfg->ce_len_type                      = 0;
  cfg->hci_tl_type                      = 1;
  cfg->hci_tl_funcs                     = NULL;
  cfg->txant_dft                        = 0;
  cfg->rxant_dft                        = 0;
  cfg->txpwr_dft                        = 7;
  cfg->cfg_mask                         = 1;
  cfg->scan_duplicate_mode              = 0;
  cfg->scan_duplicate_type              = 0;
  cfg->normal_adv_size                  = 20;
  cfg->mesh_adv_size                    = 0;

  btdm_controller_mem_init();

  if (btdm_osi_funcs_register(&g_osi_funcs) != 0)
    {
      return -EINVAL;
    }

  wlinfo("BT controller compile version [%s]\n",
                              btdm_controller_get_compile_version());

#ifdef CONFIG_PM
  /* init low-power control resources */

  memset(&g_lp_cntl, 0x0, sizeof(btdm_lpcntl_t));
  memset(&g_lp_stat, 0x0, sizeof(btdm_lpstat_t));
  g_wakeup_req_sem = NULL;
  g_btdm_slp_tmr = NULL;

  /* configure and initialize resources */

  g_lp_cntl.enable = (cfg->sleep_mode == ESP_BT_SLEEP_MODE_1) ? true : false;

  if (g_lp_cntl.enable)
    {
      g_lp_cntl.wakeup_timer_required = true;
      g_wakeup_req_sem = semphr_create_wrapper(1, 0);

      if (g_wakeup_req_sem == NULL)
        {
          goto error;
        }

      btdm_vnd_offload_task_register(BTDM_VND_OL_SIG_WAKEUP_TMR,
                                     btdm_sleep_exit_phase0);
    }

  if (g_lp_cntl.wakeup_timer_required)
    {
      esp_timer_create_args_t create_args =
        {
          .callback = btdm_slp_tmr_callback,
          .arg = NULL,
          .name = "btSlp",
        };

      if ((err = esp_timer_create(&create_args, &g_btdm_slp_tmr)) != ESP_OK)
        {
          goto error;
        }
    }

  g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
  g_btdm_lpcycle_us = 2 << (g_btdm_lpcycle_us_frac);

  if (esp32c3_rtc_clk_slow_freq_get() == RTC_SLOW_FREQ_32K_XTAL)
    {
      g_lp_cntl.lpclk_sel = BTDM_LPCLK_SEL_XTAL32K;
    }
  else
    {
      wlwarn("32.768kHz XTAL not detected");
      g_lp_cntl.lpclk_sel = BTDM_LPCLK_SEL_XTAL;
    }

  if (g_lp_cntl.lpclk_sel == BTDM_LPCLK_SEL_XTAL)
    {
      select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL);
      set_div_ret = btdm_lpclk_set_div(esp32c3_rtc_clk_xtal_freq_get() * 2);
      DEBUGASSERT(select_src_ret && set_div_ret);
      g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
      g_btdm_lpcycle_us = 2 << (g_btdm_lpcycle_us_frac);
    }
  else if (g_lp_cntl.lpclk_sel == BTDM_LPCLK_SEL_XTAL32K)
    {
      select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL32K);
      set_div_ret = btdm_lpclk_set_div(0);
      DEBUGASSERT(select_src_ret && set_div_ret);
      g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
      g_btdm_lpcycle_us = (RTC_CLK_CAL_FRACT > 15) ?
          (1000000 << (RTC_CLK_CAL_FRACT - 15)) :
          (1000000 >> (15 - RTC_CLK_CAL_FRACT));
      DEBUGASSERT(g_btdm_lpcycle_us != 0);
    }
  else if (g_lp_cntl.lpclk_sel == BTDM_LPCLK_SEL_RTC_SLOW)
    {
      select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_RTC_SLOW);
      set_div_ret = btdm_lpclk_set_div(0);
      DEBUGASSERT(select_src_ret && set_div_ret);
      g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
      g_btdm_lpcycle_us = esp_clk_slowclk_cal_get_wrapper();
    }
  else
    {
      goto error;
    }

  g_lp_stat.pm_lock_released = true;
#endif

#ifdef CONFIG_ESP32C3_WIFI_BT_COEXIST
  coex_init();
#endif

  modifyreg32(SYSTEM_WIFI_CLK_EN_REG, 0, UINT32_MAX);

